added the actual map with maplibre to the frontend
